# DataFrame

## creating data frame

#### creating from list

In [4]:
import pandas as pd
list = ['a','b','c']
print(list)
df1 = pd.DataFrame(list)
print(df1)

['a', 'b', 'c']
   0
0  a
1  b
2  c

In [ ]:
df1 # it is same as print(df1) but it shows like arrange manner

   0
0  a
1  b
2  c

#### creating using list_of_list 

- when we create a data frame of more than one column and more than one index then we use list_of_lists

In [5]:
ls_of_ls = [[1,2,3],[4,5,6],[7,8,9]]
print(ls_of_ls)
df2 = pd.DataFrame(ls_of_ls)
df2

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

#### creating dataframe using dictionary

In [5]:
dict = {'ID':[1,2,3,4]}
print(dict)

{'ID': [1, 2, 3, 4]}

In [6]:
import pandas as pd 
dict_DataFrame = pd.DataFrame(dict)
dict_DataFrame

   ID
0   1
1   2
2   3
3   4

#### creating using list of dictioanry 

- when we create a dataframe usnig dictionary more than one column and more than one index then we use list_of_dictionary

In [7]:
ls_dict = [
    {"name":'yash',"Age":21},
    {"name":'yastii',"Age":20}
]
ls_dict_dataframe = pd.DataFrame(ls_dict)
ls_dict_dataframe

     name  Age
0    yash   21
1  yastii   20

when two list of dictionary have two different value

In [8]:
ls_dict = [
    {"name":'yash',"Age":21},
    {"name":'yastii',"Age":20,"marks":90}
]
ls_dict_dataframe = pd.DataFrame(ls_dict)
ls_dict_dataframe

     name  Age  marks
0    yash   21    NaN
1  yastii   20   90.0

#### creating using dictionary of list

In [9]:
data = {
    "state":["ohio","ohio","ohio","nevada","nevada","nevada"],
    "year" :[2000,2001,2002,2001,2002,2003],
    "pop"  :[1.5,1.7,3.6,2.4,2.9,3.2]
}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

#### creating using dictionary of series

In [10]:
dict_s = {'ID':pd.Series([1,2,3]),'SN':[111,222,333]}
data_frame = pd.DataFrame(dict_s)
data_frame

   ID   SN
0   1  111
1   2  222
2   3  333

### some methods of data frame :

- 1. Head method  
  
   - it select the only the first five row

In [13]:
data = {
    "state":["ohio","ohio","ohio","nevada","nevada","nevada"],
    "year" :[2000,2001,2002,2001,2002,2003],
    "pop"  :[1.5,1.7,3.6,2.4,2.9,3.2]
}
frame = pd.DataFrame(data)
frame.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

- 2. tails method 
  
   - it returns the last five rows

In [14]:
frame.tail()

    state  year  pop
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

you can also specify the column with a specifc name in dataFrame which can the sequence of the dataframe

In [19]:
data = {
    "state":["ohio","ohio","ohio","nevada","nevada","nevada"],
    "year" :[2000,2001,2002,2001,2002,2003],
    "pop"  :[1.5,1.7,3.6,2.4,2.9,3.2]
}
frame = pd.DataFrame(data,columns=["pop","state","year"])
print(frame)

   pop   state  year
0  1.5    ohio  2000
1  1.7    ohio  2001
2  3.6    ohio  2002
3  2.4  nevada  2001
4  2.9  nevada  2002
5  3.2  nevada  2003

if you pass the column which is not present in the dictionary then it will consider as a missing value in the list

In [ ]:
data = {
    "state":["ohio","ohio","ohio","nevada","nevada","nevada"],
    "year" :[2000,2001,2002,2001,2002,2003],
    "pop"  :[1.5,1.7,3.6,2.4,2.9,3.2]
}
frame = pd.DataFrame(data,columns=["name","saal","post"])
print(frame)

in dataframe you can call a particular column using their index name

In [20]:
data = {
    "state":["ohio","ohio","ohio","nevada","nevada","nevada"],
    "year" :[2000,2001,2002,2001,2002,2003],
    "pop"  :[1.5,1.7,3.6,2.4,2.9,3.2]
}
frame = pd.DataFrame(data,columns=["pop","state","year"])
print(frame["state"])

0      ohio
1      ohio
2      ohio
3    nevada
4    nevada
5    nevada
Name: state, dtype: object

calling rows by index

In [ ]:
data = {
    "state":["ohio","ohio","ohio","nevada","nevada","nevada"],
    "year" :[2000,2001,2002,2001,2002,2003],
    "pop"  :[1.5,1.7,3.6,2.4,2.9,3.2]
}
frame = pd.DataFrame(data,columns=["pop","state","year"])
print(frame.loc[1]) # 1 this is an index 
print(frame.iloc[2]) # 2 this is an index

pop       1.7
state    ohio
year     2001
Name: 1, dtype: object
pop       3.6
state    ohio
year     2002
Name: 2, dtype: object

columns can modified by assignment

In [25]:
frame["pop"] = 16.5
frame

    pop   state  year
0  16.5    ohio  2000
1  16.5    ohio  2001
2  16.5    ohio  2002
3  16.5  nevada  2001
4  16.5  nevada  2002
5  16.5  nevada  2003

In [27]:
import numpy as np
frame["pop"] = np.arange(6.)
frame

   pop   state  year
0  0.0    ohio  2000
1  1.0    ohio  2001
2  2.0    ohio  2002
3  3.0  nevada  2001
4  4.0  nevada  2002
5  5.0  nevada  2003